results/results_old/data/run3/jvm-db/erik-laptop/quarkus-io-thread-34000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 10.646ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 10.146ms, rate sampling interval: 49ms
  Thread calibration: mean lat.: 14.063ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 11.479ms, rate sampling interval: 54ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.95ms   14.30ms 267.01ms   86.63%
    Req/Sec     8.58k     2.96k   17.04k    60.03%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.08ms
 75.000%   22.48ms
 90.000%   30.43ms
 99.000%   58.78ms
 99.900%  130.82ms
 99.990%  228.74ms
 99.999%  265.21ms
100.000%  267.26ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.308     0.000000            1         1.00
       1.152     0.100000       169619         1.11
       1.557     0.200000       339189         1.25
       2.227     0.300000       508723         1.43
       5.979     0.400000       678390         1.67
      11.079     0.500000       847956         2.00
      13.495     0.550000       932740         2.22
      15.831     0.600000      1017450         2.50
      18.095     0.650000      1102744         2.86
      20.271     0.700000      1186993         3.33
      22.479     0.750000      1272040         4.00
      23.615     0.775000      1314275         4.44
      24.783     0.800000      1356835         5.00
      25.999     0.825000      1399265         5.71
      27.327     0.850000      1441753         6.67
      28.783     0.875000      1484000         8.00
      29.583     0.887500      1505261         8.89
      30.431     0.900000      1526450        10.00
      31.359     0.912500      1547663        11.43
      32.399     0.925000      1568776        13.33
      33.599     0.937500      1590082        16.00
      34.303     0.943750      1600486        17.78
      35.103     0.950000      1610942        20.00
      36.063     0.956250      1621597        22.86
      37.247     0.962500      1632169        26.67
      38.879     0.968750      1642772        32.00
      39.999     0.971875      1648095        35.56
      41.471     0.975000      1653310        40.00
      43.487     0.978125      1658627        45.71
      46.175     0.981250      1663909        53.33
      49.727     0.984375      1669213        64.00
      51.839     0.985938      1671886        71.11
      54.015     0.987500      1674504        80.00
      56.831     0.989062      1677155        91.43
      60.191     0.990625      1679815       106.67
      64.607     0.992188      1682459       128.00
      67.839     0.992969      1683810       142.22
      71.295     0.993750      1685111       160.00
      75.199     0.994531      1686437       182.86
      80.191     0.995313      1687762       213.33
      85.311     0.996094      1689077       256.00
      88.255     0.996484      1689742       284.44
      91.711     0.996875      1690405       320.00
      96.383     0.997266      1691066       365.71
     101.695     0.997656      1691731       426.67
     108.607     0.998047      1692390       512.00
     112.639     0.998242      1692722       568.89
     117.119     0.998437      1693050       640.00
     121.343     0.998633      1693381       731.43
     126.015     0.998828      1693711       853.33
     131.583     0.999023      1694049      1024.00
     134.655     0.999121      1694210      1137.78
     138.623     0.999219      1694376      1280.00
     142.335     0.999316      1694542      1462.86
     146.303     0.999414      1694708      1706.67
     150.271     0.999512      1694874      2048.00
     151.935     0.999561      1694954      2275.56
     154.495     0.999609      1695036      2560.00
     157.439     0.999658      1695120      2925.71
     163.199     0.999707      1695202      3413.33
     167.807     0.999756      1695287      4096.00
     171.007     0.999780      1695326      4551.11
     175.999     0.999805      1695370      5120.00
     180.863     0.999829      1695409      5851.43
     205.439     0.999854      1695450      6826.67
     219.519     0.999878      1695493      8192.00
     226.047     0.999890      1695513      9102.22
     230.527     0.999902      1695533     10240.00
     236.287     0.999915      1695555     11702.86
     241.791     0.999927      1695574     13653.33
     247.167     0.999939      1695595     16384.00
     248.447     0.999945      1695605     18204.44
     252.159     0.999951      1695616     20480.00
     255.231     0.999957      1695626     23405.71
     256.767     0.999963      1695636     27306.67
     258.431     0.999969      1695647     32768.00
     259.199     0.999973      1695652     36408.89
     260.735     0.999976      1695658     40960.00
     261.503     0.999979      1695662     46811.43
     262.655     0.999982      1695668     54613.33
     263.935     0.999985      1695675     65536.00
     263.935     0.999986      1695675     72817.78
     264.703     0.999988      1695678     81920.00
     265.215     0.999989      1695682     93622.86
     265.471     0.999991      1695686    109226.67
     265.471     0.999992      1695686    131072.00
     265.727     0.999993      1695688    145635.56
     265.727     0.999994      1695688    163840.00
     265.983     0.999995      1695690    187245.71
     266.239     0.999995      1695695    218453.33
     266.239     0.999996      1695695    262144.00
     266.239     0.999997      1695695    291271.11
     266.239     0.999997      1695695    327680.00
     266.239     0.999997      1695695    374491.43
     266.239     0.999998      1695695    436906.67
     266.239     0.999998      1695695    524288.00
     266.495     0.999998      1695697    582542.22
     266.495     0.999998      1695697    655360.00
     266.495     0.999999      1695697    748982.86
     266.495     0.999999      1695697    873813.33
     266.495     0.999999      1695697   1048576.00
     266.495     0.999999      1695697   1165084.44
     266.495     0.999999      1695697   1310720.00
     266.495     0.999999      1695697   1497965.71
     267.263     0.999999      1695698   1747626.67
     267.263     1.000000      1695698          inf
#[Mean    =       13.949, StdDeviation   =       14.303]
#[Max     =      267.008, Total count    =      1695698]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2037904 requests in 1.00m, 330.39MB read
Requests/sec:  33965.48
Transfer/sec:      5.51MB