results/results_old/data/run3/jvm-db/erik-laptop/quarkus-io-thread-34000-WARM-UP.wrk2.out
Running 1m test @ http://erik-pc.local:8080/fruits
  4 threads and 100 connections
  Thread calibration: mean lat.: 7.011ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 5.978ms, rate sampling interval: 37ms
  Thread calibration: mean lat.: 5.618ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 5.974ms, rate sampling interval: 35ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.73ms    8.99ms 111.23ms   81.96%
    Req/Sec     8.62k     2.81k   18.24k    65.42%
  2037921 requests in 1.00m, 330.40MB read
Requests/sec:  33965.92
Transfer/sec:      5.51MB